_posts/programming/2013-12-19-x86-registers.html
---
layout: post
title: x86 寄存器
categories: [programming]
tags: [comp arch]
---

<p>
X86 處理器寄存器（Register<sup>en</sup> ，le registre<sup>fr</sup> ，das Register<sup>de</sup> ，暫存器<sup>tw</sup> ）是編寫 X86 彙編語言（Assembly Language<sup>en</sup> ，langage d'assemblage ou langage assembleur<sup>fr</sup> ，Assemblersprache<sup>de</sup> ，組合語言<sup>tw</sup>  ）程序的核心工具。寄存器相當於處理器的一些內部變量。寄存器讀寫速度比內存更快，指令週期更少。本文簡單介紹一些 X86 系列處理器寄存器的使用方法。本文描述的一些使用規則只是一些建議性規則，而不是強制性規則。有些操作可能需要某些特定寄存器，但對於大部份寄存器，可以完全由你自己決定怎麼使用。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 寄存器彙總</h2>
<div class="outline-text-2" id="text-1">
<p>
X86 系列處理器總共有下列 16 個 32 位寄存器。這些寄存器大部份可以拆分成 16 位或者 8 位寄存器使用。
</p>

<ul class="org-ul">
<li>通用寄存器（General purpose registers-GPRs）
</li>
</ul>
<p>
<code>EAX EBX ECX EDX</code>
</p>
<ul class="org-ul">
<li>區段寄存器（Segment registers<sup>en</sup> ，des registres de segments<sup>fr</sup> ）
</li>
</ul>
<p>
<code>CS DS ES FS GS SS</code>
</p>
<ul class="org-ul">
<li>索引和指針（Index and pointer，le registre d'index et le pointeur<sup>fr</sup> ，Die Indexregister und Der Zeiger<sup>de</sup> ）
</li>
</ul>
<p>
<code>ESI EDI EBP EIP ESP</code>
</p>
<ul class="org-ul">
<li>狀態寄存器（status register, flag register, or condition code register<sup>en</sup> ，das Zustandsregister order das Statusregister<sup>de</sup> ）
</li>
</ul>
<p>
<code>EFLAGS</code>
</p>

<p>
<code>EAX</code> 等寄存器的前綴 <code>E</code> 來自英語 Extended（擴展的）。因為最初的 Intel 8086/8088 處理器只有 14 個 16 位寄存器。其中 4 個通用寄存器（AX，BX，CX，DX）；2 個指針寄存器（SP，BP），2 個索引寄存器（SI，DI），4 個區段寄存器（CS，DS，SS，ES），1 個狀態寄存器（FLAGS），1 個指令指針寄存器（IP）。而 32 位的 80386 處理器把其中的 16 位的通用寄存器，指針寄存器，索引寄存器，指令指針寄存器，以及狀態寄存器擴展成 32 位寄存器。比如 AX 寄存器對應到了新的 32 位寄存器 EAX 的低 16 位，SI 寄存器對應到 32 位寄存器 ESI 的低 16 位。注意，區段寄存器沒有 <code>E</code> 前綴，仍然保留 16 位的大小。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 通用寄存器（General Purpose Registers - GPRs<sup>en</sup> ）</h2>
<div class="outline-text-2" id="text-2">
<p>
我們大部份時間大部份指令都在用的寄存器叫做通用寄存器。這些寄存器可以再分解成 16 位或者 8 位的寄存器。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">32 位寄存器</td>
<td class="left">EAX EBX ECX EDX</td>
</tr>

<tr>
<td class="left">16 位寄存器</td>
<td class="left">AX BX CX DX</td>
</tr>

<tr>
<td class="left">8 位寄存器</td>
<td class="left">AH AL BH BL CH CL DH DL</td>
</tr>
</tbody>
</table>

<p>
H 和 L 分别表示 16 位中的高 8 位和低 8 位。
</p>

<p>
我们再看看这四组通用寄存器其有哪些细微的差别。
</p>

<dl class="org-dl">
<dt> EAX,AX,AH,AL </dt><dd>累加寄存器（Accumulator register<sup>en</sup> ，le accumulateur<sup>fr</sup> ，der Akkumulator<sup>de</sup> ）一般用来处理 I/O 端口访问，数学计算，中断调用等。
</dd>
<dt> EBX,BX,BH,BL </dt><dd>基址寄存器（Base register<sup>en</sup> ）一般用以內存訪問時候的基址指針，以及獲取某些中斷函數的返回值。
</dd>
<dt> ECX,CX,CH,CL </dt><dd>計數寄存器（Counter register<sup>en</sup> ）一般用在循環計數和位移操作中，還用來獲取某些中斷函數的返回值。
</dd>
<dt> EDX,DX,DH,DL </dt><dd>數據寄存器（Data register<sup>en</sup> ）和累加寄存器一樣用来处理 I/O 端口访问，数学计算，中断调用等。
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 區段寄存器（Segment registers<sup>en</sup> ）</h2>
<div class="outline-text-2" id="text-3">
<p>
區段寄存器保存若干區段的地址。區段寄存器只能通過通用寄存器或者特殊指令修改。
</p>
<dl class="org-dl">
<dt> CS </dt><dd>代碼段寄存器（Code segment register）記錄程序運行的代碼段地址。人為修改會導致程序無法正確運行。
</dd>
<dt> DS </dt><dd>數據段寄存器（Data segment register）記錄程序訪問的數據段地址。人為修改可能導致錯誤的數據。
</dd>
<dt> ES,FS,GS </dt><dd>這幾個額外的區段寄存器用以 <code>far</code> 指針訪問，比如視頻內存等。
</dd>
<dt> SS </dt><dd>棧區段寄存器（Stack segment register）記錄程序使用的棧區段地址。有時候 SS 和 DS 是一樣的。人為修改會導致無法預期的數據結果。
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 索引和指針寄存器（Indexes and pointers<sup>en</sup> ）</h2>
<div class="outline-text-2" id="text-4">
<p>
索引和指針寄存器用作區段地址的偏移量。 <code>E</code> 開頭的寄存器只在保護模式（Protected Mode<sup>en</sup> ）下使用。
</p>

<dl class="org-dl">
<dt> ES:EDI EDI DI </dt><dd>目的索引寄存器（Destination index register<sup>en</sup> ）用作字符串、數組拷貝目的地址，以及和 <code>ES</code> 配合 <code>far</code> 指針尋址。
</dd>
<dt> DS:ESI ESI SI </dt><dd>源索引寄存器（Source index register<sup>en</sup> ）用作字符串、數組拷貝的源地址。
</dd>
<dt> SS:EBP EBP BP </dt><dd>棧基址指針寄存器（Stack Base pointer register<sup>en</sup> ）保存程序棧的基地址。
</dd>
<dt> SS:ESP ESP SP </dt><dd>棧指針寄存器（Stack pointer register<sup>en</sup> ）保存程序棧的棧頂地址。
</dd>
<dt> CS:EIP EIP IP </dt><dd>程序指針（Instruction Pointer<sup>en</sup> ）保存下一條指令的偏移地址。
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 狀態寄存器（EFLAGS register）</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>EFLAGS</code> 狀態寄存器保存當前處理器的狀態。 <code>EFLAGS</code> 用作條件跳轉，條件循環，數值比較。每一位都可以用來表示上一條特定指令的執行結果。每一位的功能如下：
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">位</th>
<th scope="col" class="left">標記</th>
<th scope="col" class="left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">0</td>
<td class="left">CF</td>
<td class="left">Carry flag</td>
</tr>

<tr>
<td class="right">1</td>
<td class="left">&#xa0;</td>
<td class="left">Reserved</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">PF</td>
<td class="left">Parity flag</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">&#xa0;</td>
<td class="left">Reserved</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">AF</td>
<td class="left">Auxiliary carry flag</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left">ZF</td>
<td class="left">Zero flag</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left">SF</td>
<td class="left">Sign flag</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left">TF</td>
<td class="left">Trap flag</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left">IF</td>
<td class="left">Interrupt enable flag</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left">DF</td>
<td class="left">Direction flag</td>
</tr>

<tr>
<td class="right">11</td>
<td class="left">OF</td>
<td class="left">Overflow flag</td>
</tr>

<tr>
<td class="right">12-13</td>
<td class="left">IOPL</td>
<td class="left">I/O Privilege level</td>
</tr>

<tr>
<td class="right">14</td>
<td class="left">NT</td>
<td class="left">Nexted task flag</td>
</tr>

<tr>
<td class="right">15</td>
<td class="left">&#xa0;</td>
<td class="left">Reserved</td>
</tr>

<tr>
<td class="right">16</td>
<td class="left">RF</td>
<td class="left">Resume flag</td>
</tr>

<tr>
<td class="right">17</td>
<td class="left">VM</td>
<td class="left">Virtual 8086 mode flag</td>
</tr>

<tr>
<td class="right">18</td>
<td class="left">AC</td>
<td class="left">Alignment check flag</td>
</tr>

<tr>
<td class="right">19</td>
<td class="left">VIF</td>
<td class="left">Virtual interrupt flag</td>
</tr>

<tr>
<td class="right">20</td>
<td class="left">VIP</td>
<td class="left">Virtual interrupt pending flag</td>
</tr>

<tr>
<td class="right">21</td>
<td class="left">ID</td>
<td class="left">ID flag</td>
</tr>

<tr>
<td class="right">22-31</td>
<td class="left">&#xa0;</td>
<td class="left">Reserved</td>
</tr>
</tbody>
</table>
</div>
</div>
